:PROPERTIES:
:ID:       d159e9cc-764a-4f1d-944b-03a3c884a6ea
:END:
#+title: python-oop
#+startup: overview
#+filetags: :python:oop:

* 类对象
#+begin_src python :results output
class TestClass:
    i = 12345

    def f(self):
        return "hello world"


x = TestClass()
print(x.f())
print(x.i)
#+end_src

#+RESULTS:
: hello world
: 12345
** 初始化
类有一个名为 __init__() 的特殊方法（构造方法），该方法在类实例化时会自动调用，像下面这样：
#+begin_src
def __init__(self):
    self.data = []

#+end_src

__init()__函数可以有参数
#+begin_src python :results output
class Complex:
    def __init__(self, realpart, imagpart):
        self.r = realpart
        self.i = imagpart
x = Complex(3.0, -4.5)
print(x.r, x.i)   # 输出结果：3.0 -4.5
#+end_src

#+RESULTS:
: 3.0 -4.5

可以把self当成this指针来看

* 运算符重载
| 函数名字 | 描述     |
|----------+----------|
| __cmp__    | 比较运算 |
| __add__    | 加运算   |
| __sub__    | 减运算   |
| __mul__    | 乘运算   |
| _truediv__ | 除运算   |
| __mod__    | 求余运算 |
| __pow__    | 乘方     |


#+begin_src python :results output
#!/usr/bin/python3
 
class Vector:
   def __init__(self, a, b):
      self.a = a
      self.b = b
 
   def __str__(self):
      return 'Vector (%d, %d)' % (self.a, self.b)
   
   def __add__(self,other):
      return Vector(self.a + other.a, self.b + other.b)
 
v1 = Vector(2,10)
v2 = Vector(5,-2)
print (v1 + v2)
#+end_src

#+RESULTS:
: Vector (7, 8)
